Autodesk.Navisworks.Api.KeyModifiers
Enumerates key modifiers used in input into Navisworks

Autodesk.Navisworks.Api.KeyModifiers.None
No modifier keys pressed

Autodesk.Navisworks.Api.KeyModifiers.Shift
SHIFT modifier key pressed

Autodesk.Navisworks.Api.KeyModifiers.Alt
ALT modifier keys pressed

Autodesk.Navisworks.Api.KeyModifiers.Ctrl
CTRL modifier key pressed

Autodesk.Navisworks.Api.KeyModifiers.DoubleClick
Double Click